// 数据时有按层级逐级给的

const cats = {
    1: {
        label: "艺术",
        cats: {
            2: {
                label: "器乐",
                cats: {
                    3: {
                        label: "钢琴",
                    },
                    4: {
                        label: "吉他",
                    },
                    5: {
                        label: "古筝",
                    },
                    6: {
                        label: "葫芦丝",
                    },
                    7: {
                        label: "小提琴",
                    },
                    8: {
                        label: "萨克斯",
                    },
                    9: {
                        label: "琵琶",
                    },
                    10: {
                        label: "二胡",
                    },
                    11: {
                        label: "电子琴",
                    },
                    12: {
                        label: "架子鼓",
                    },
                    13: {
                        label: "大提琴",
                    },
                    14: {
                        label: "电吉他",
                    },
                    15: {
                        label: "单簧管",
                    },
                    16: {
                        label: "双簧管",
                    },
                    17: {
                        label: "笛子",
                    },
                    18: {
                        label: "扬琴",
                    },
                    19: {
                        label: "爵士鼓",
                    },
                    20: {
                        label: "长号",
                    },
                    21: {
                        label: "唢呐",
                    },
                    22: {
                        label: "小号",
                    },
                    23: {
                        label: "圆号",
                    },
                    24: {
                        label: "手鼓",
                    },
                    25: {
                        label: "非洲鼓",
                    },
                    26: {
                        label: "马林巴",
                    },
                    27: {
                        label: "口琴",
                    },
                    28: {
                        label: "贝斯",
                    },
                    29: {
                        label: "手风琴",
                    },
                    30: {
                        label: "箫",
                    },
                    31: {
                        label: "尤克里里",
                    },
                    32: {
                        label: "竖琴",
                    },
                    33: {
                        label: "古琴",
                    },
                    34: {
                        label: "箜篌",
                    },
                    537: {
                        label: "中提琴",
                    },
                    538: {
                        label: "低音提琴",
                    },
                    539: {
                        label: "双排键",
                    },
                }
            },
            35: {
                label: "声乐",
                cats: {
                    36: {
                        label: "流行",
                    },
                    37: {
                        label: "卡拉OK",
                    },
                    38: {
                        label: "美声",
                    },
                    39: {
                        label: "民族",
                    },
                    40: {
                        label: "原生态",
                    },
                }
            },
            41: {
                label: "音乐其他",
                cats: {
                    42: {
                        label: "音乐理论",
                        pid: 41
                    },
                    43: {
                        label: "指挥",
                        pid: 41
                    },
                    44: {
                        label: "作曲",
                        pid: 41
                    },
                    45: {
                        label: "音乐基本素养",
                        pid: 41
                    },
                    46: {
                        label: "音乐表演",
                        pid: 41
                    },
                    47: {
                        label: "音乐艺术管理",
                        pid: 41
                    },
                    48: {
                        label: "音乐工程",
                        pid: 41
                    },
                }
            },
            49: {
                label: "舞蹈",
                cats: {
                    50: {
                        label: "街舞",
                    },
                    51: {
                        label: "拉丁舞",
                    },
                    52: {
                        label: "芭蕾舞",
                    },
                    53: {
                        label: "现代舞",
                    },
                    54: {
                        label: "爵士舞",
                    },
                    55: {
                        label: "肚皮舞",
                    },
                    56: {
                        label: "古典舞",
                    },
                    57: {
                        label: "民族舞",
                    },
                    58: {
                        label: "韩舞",
                    },
                    59: {
                        label: "钢管舞",
                    },
                    60: {
                        label: "健美操",
                    },
                    61: {
                        label: "民间舞",
                    },
                    62: {
                        label: "国标舞",
                    },
                    63: {
                        label: "探戈",
                    },
                    64: {
                        label: "广场舞",
                    },
                    65: {
                        label: "啦啦队舞",
                    },
                    66: {
                        label: "锐舞",
                    },
                    67: {
                        label: "迪斯科",
                    },
                    68: {
                        label: "集体舞",
                    },
                    69: {
                        label: "踢踏舞",
                    },
                    70: {
                        label: "TB秀",
                    },
                }
            },
            71: {
                label: "绘画",
                cats: {
                    72: {
                        label: "素描",
                    },
                    73: {
                        label: "创意画",
                    },
                    74: {
                        label: "国画",
                    },
                    75: {
                        label: "油画",
                    },
                    76: {
                        label: "水粉画",
                    },
                    77: {
                        label: "水彩画",
                    },
                    78: {
                        label: "沙画",
                    },
                    79: {
                        label: "插画",
                    },
                    80: {
                        label: "卡通画",
                    },
                    81: {
                        label: "简笔画",
                    },
                    82: {
                        label: "速写",
                    },
                    83: {
                        label: "漫画",
                    },
                }
            },
            85: {
                label: "媒体艺术",
                cats: {
                    86: {
                        label: "播音主持",
                    },
                    87: {
                        label: "影视表演",
                    },
                    88: {
                        label: "摄影培训",
                    },
                    89: {
                        label: "编导培训",
                    },
                    90: {
                        label: "电视包装",
                    },
                    91: {
                        label: "DJ培训",
                    },
                    92: {
                        label: "影视制作",
                    },
                    93: {
                        label: "模特培训",
                    },
                }
            },
            94: {
                label: "书法",
                cats: {
                    95: {
                        label: "硬笔书法",
                    },
                    96: {
                        label: "软笔书法",
                    },
                }
            },
            97: {
                label: "雕塑",
                cats: {
                    98: {
                        label: "皮雕",
                    },
                    99: {
                        label: "木雕",
                    },
                    100: {
                        label: "泥雕",
                    },
                    101: {
                        label: "面塑",
                    },
                    102: {
                        label: "石雕",
                    },
                    103: {
                        label: "根雕",
                    },
                    104: {
                        label: "冰雕",
                    },
                    105: {
                        label: "漆雕",
                    },
                    106: {
                        label: "沙雕",
                    },
                    107: {
                        label: "玉雕",
                    },
                    108: {
                        label: "石膏像",
                    },
                    109: {
                        label: "牙雕",
                    },
                    110: {
                        label: "创意雕塑",
                    },
                    111: {
                        label: "陶艺",
                    },
                }
            },
            112: {
                label: "鉴赏",
                cats: {
                    113: {
                        label: "古玩鉴赏",
                    },
                    114: {
                        label: "字画鉴赏",
                    },
                    115: {
                        label: "红酒鉴赏",
                    },
                }
            },
            116: {
                label: "戏剧",
                cats: {
                    117: {
                        label: "京剧",
                    },
                    118: {
                        label: "话剧",
                    },
                    119: {
                        label: "黄梅戏",
                    },
                    120: {
                        label: "川剧",
                    },
                    121: {
                        label: "秦腔",
                    },
                    122: {
                        label: "昆曲",
                    },
                    123: {
                        label: "越剧",
                    },
                    124: {
                        label: "豫剧",
                    },
                    125: {
                        label: "晋剧",
                    },
                    126: {
                        label: "评剧",
                    },
                    127: {
                        label: "二人转",
                    },
                    518: {
                        label: "潮剧",
                    },
                }
            },
        }
    },
    128: {
        label: "体育",
        cats: {
            129: {
                label: "运动",
                cats: {
                    130: {
                        label: "游泳",
                    },
                    131: {
                        label: "羽毛球",
                    },
                    132: {
                        label: "乒乓球",
                    },
                    133: {
                        label: "篮球",
                    },
                    134: {
                        label: "网球",
                    },
                    135: {
                        label: "足球",
                    },
                    136: {
                        label: "排球",
                    },
                    137: {
                        label: "瑜伽",
                    },
                    138: {
                        label: "台球",
                    },
                    139: {
                        label: "跑酷",
                    },
                    140: {
                        label: "轮滑",
                    },
                    141: {
                        label: "滑板",
                    },
                    142: {
                        label: "骑行",
                    },
                    143: {
                        label: "普拉提",
                    },
                    144: {
                        label: "高尔夫",
                    },
                    145: {
                        label: "耐力跑",
                    },
                    146: {
                        label: "水球",
                    },
                    147: {
                        label: "棒球",
                    },
                    148: {
                        label: "马球",
                    },
                    149: {
                        label: "橄榄球",
                    },
                    150: {
                        label: "曲棍球",
                    },
                    151: {
                        label: "潜水",
                    },
                    152: {
                        label: "击剑",
                    },
                    153: {
                        label: "健身",
                    },
                    154: {
                        label: "门球",
                    },
                    155: {
                        label: "赛车",
                    },
                    156: {
                        label: "跳绳",
                    },
                    526: {
                        label: "帆船",
                    },
                    530: {
                        label: "游艇",
                    },
                    542: {
                        label: "射箭",
                    },
                }
            },
            157: {
                label: "武术",
                cats: {
                    158: {
                        label: "太极拳",
                    },
                    159: {
                        label: "跆拳道",
                    },
                    160: {
                        label: "散打",
                    },
                    161: {
                        label: "泰拳",
                    },
                    162: {
                        label: "空手道",
                    },
                    163: {
                        label: "柔道",
                    },
                    164: {
                        label: "剑道",
                    },
                    165: {
                        label: "传统武术",
                    },
                    166: {
                        label: "少林拳",
                    },
                    167: {
                        label: "体适能",
                    },
                    168: {
                        label: "气功",
                    },
                    169: {
                        label: "咏春拳",
                    },
                    170: {
                        label: "自由搏击",
                    },
                    171: {
                        label: "女子防身术",
                    },
                    172: {
                        label: "形意拳",
                    },
                    173: {
                        label: "截拳道",
                    },
                }
            },
            174: {
                label: "棋牌",
                cats: {
                    175: {
                        label: "围棋",
                    },
                    176: {
                        label: "桥牌",
                    },
                    177: {
                        label: "双升",
                    },
                    178: {
                        label: "牌九",
                    },
                    179: {
                        label: "德州扑克",
                    },
                    180: {
                        label: "斗地主",
                    },
                    181: {
                        label: "麻将",
                    },
                    182: {
                        label: "五子棋",
                    },
                    183: {
                        label: "国际象棋",
                    },
                    184: {
                        label: "象棋",
                    },
                }
            },
        }
    },
    185: {
        label: "生活",
        cats: {
            186: {
                label: "生活技能",
                cats: {
                    187: {
                        label: "化妆技巧",
                    },
                    188: {
                        label: "家常菜",
                    },
                    189: {
                        label: "烘焙",
                    },
                    190: {
                        label: "沟通技巧",
                    },
                    191: {
                        label: "缝纫",
                    },
                    192: {
                        label: "生存逃生",
                    },
                    193: {
                        label: "车辆驾驶",
                    },
                    194: {
                        label: "烹饪",
                    },
                    195: {
                        label: "理财",
                    },
                    196: {
                        label: "家庭教育",
                    },
                    197: {
                        label: "心理辅导",
                    },
                    198: {
                        label: "情感咨询",
                    },
                    199: {
                        label: "养生",
                    },
                    532: {
                        label: "推拿",
                    },
                    544: {
                        label: "发型设计",
                    },
                    545: {
                        label: "纹绣",
                    },
                }
            },
            200: {
                label: "兴趣",
                cats: {
                    201: {
                        label: "魔术",
                    },
                    202: {
                        label: "魔方",
                    },
                    203: {
                        label: "游戏",
                    },
                    204: {
                        label: "动漫",
                    },
                    205: {
                        label: "塔罗牌",
                    },
                    206: {
                        label: "星座",
                    },
                    207: {
                        label: "演讲",
                    },
                    208: {
                        label: "手工布艺",
                    },
                    209: {
                        label: "园艺",
                    },
                    210: {
                        label: "插花",
                    },
                    211: {
                        label: "咖啡",
                    },
                    212: {
                        label: "调酒",
                    },
                    213: {
                        label: "趣味编程",
                    },
                    527: {
                        label: "茶艺",
                    },
                    528: {
                        label: "纹身",
                    },
                    529: {
                        label: "美甲",
                    },
                }
            },
        }
    },
    214: {
        label: "出国",
        cats: {
            215: {
                label: "留学考试",
                cats: {
                    216: {
                        label: "托福",
                    },
                    217: {
                        label: "雅思",
                    },
                    218: {
                        label: "SAT",
                    },
                    219: {
                        label: "GRE",
                    },
                    220: {
                        label: "GMAT",
                    },
                    221: {
                        label: "TOEFL Junior",
                    },
                    222: {
                        label: "ACT",
                    },
                    223: {
                        label: "SSAT",
                    },
                    224: {
                        label: "AP",
                    },
                    225: {
                        label: "IB Course",
                    },
                    226: {
                        label: "LSAT",
                    },
                    227: {
                        label: "A_Level",
                    },
                    228: {
                        label: "O_Level",
                    },
                    229: {
                        label: "PTE",
                    },
                    230: {
                        label: "留学预科",
                    },
                }
            },
            231: {
                label: "留学指导",
                cats: {
                    232: {
                        label: "亚洲留学",
                    },
                    233: {
                        label: "美洲留学",
                    },
                    234: {
                        label: "澳新留学",
                    },
                    235: {
                        label: "欧洲留学",
                    },
                }
            },
            236: {
                label: "出国旅行",
                cats: {
                    237: {
                        label: "签证办理",
                    },
                    238: {
                        label: "行程安排",
                    },
                    239: {
                        label: "景区攻略",
                    },
                }
            },
            240: {
                label: "移民",
                cats: {
                    241: {
                        label: "移民",
                    },
                }
            },
        }
    },
    242: {
        label: "幼小",
        cats: {
            243: {
                label: "早教",
                cats: {
                    244: {
                        label: "益智",
                    },
                    245: {
                        label: "潜能开发",
                    },
                    246: {
                        label: "感统训练",
                    },
                    247: {
                        label: "亲子",
                    },
                    248: {
                        label: "启蒙",
                    },
                    249: {
                        label: "才艺",
                    },
                }
            },
            250: {
                label: "幼儿园",
                cats: {
                    251: {
                        label: "择园经验",
                    },
                    252: {
                        label: "多元智能",
                    },
                    253: {
                        label: "创意",
                    },
                    254: {
                        label: "体育",
                    },
                    255: {
                        label: "健康",
                    },
                    256: {
                        label: "社会教育",
                    },
                    257: {
                        label: "科学",
                    },
                    258: {
                        label: "艺术",
                    },
                    259: {
                        label: "英语",
                    },
                    260: {
                        label: "数学",
                    },
                    261: {
                        label: "语言",
                    },
                    262: {
                        label: "政策信息",
                    },
                    263: {
                        label: "手工活动",
                    },
                }
            },
            264: {
                label: "学前艺术",
                cats: {
                    265: {
                        label: "奥尔夫音乐",
                    },
                    266: {
                        label: "学前艺体",
                    },
                    267: {
                        label: "蒙氏教育",
                    },
                }
            },
            268: {
                label: "幼升小",
                cats: {
                    269: {
                        label: "择校",
                    },
                    270: {
                        label: "习惯养成",
                    },
                    271: {
                        label: "手工",
                    },
                    272: {
                        label: "创意",
                    },
                    273: {
                        label: "体育",
                    },
                    274: {
                        label: "健康",
                    },
                    275: {
                        label: "社会教育",
                    },
                    276: {
                        label: "科学",
                    },
                    277: {
                        label: "艺术",
                    },
                    278: {
                        label: "英语",
                    },
                    279: {
                        label: "数学",
                    },
                    280: {
                        label: "语言",
                    },
                    281: {
                        label: "面试",
                    },
                    282: {
                        label: "简历",
                    },
                    283: {
                        label: "咨询",
                    },
                    284: {
                        label: "纪律养成",
                    },
                }
            },
            285: {
                label: "一年级",
                cats: {
                    286: {
                        label: "数学",
                    },
                    287: {
                        label: "语文",
                    },
                    288: {
                        label: "英语",
                    },
                    289: {
                        label: "奥数",
                    },
                }
            },
            290: {
                label: "二年级",
                cats: {
                    291: {
                        label: "数学",
                    },
                    292: {
                        label: "语文",
                    },
                    293: {
                        label: "英语",
                    },
                    294: {
                        label: "奥数",
                    },
                }
            },
            295: {
                label: "三年级",
                cats: {
                    296: {
                        label: "数学",
                    },
                    297: {
                        label: "语文",
                    },
                    298: {
                        label: "英语",
                    },
                    299: {
                        label: "奥数",
                    },
                }
            },
            300: {
                label: "四年级",
                cats: {
                    301: {
                        label: "数学",
                    },
                    302: {
                        label: "语文",
                    },
                    303: {
                        label: "英语",
                    },
                    304: {
                        label: "奥数",
                    },
                }
            },
            305: {
                label: "五年级",
                cats: {
                    306: {
                        label: "数学",
                    },
                    307: {
                        label: "语文",
                    },
                    308: {
                        label: "英语",
                    },
                    309: {
                        label: "奥数",
                    },
                }
            },
            310: {
                label: "六年级",
                cats: {
                    311: {
                        label: "数学",
                    },
                    312: {
                        label: "语文",
                    },
                    313: {
                        label: "英语",
                    },
                    314: {
                        label: "奥数",
                    },
                }
            },
            315: {
                label: "小升初",
                cats: {
                    316: {
                        label: "数学",
                    },
                    317: {
                        label: "语文",
                    },
                    318: {
                        label: "英语",
                    },
                    319: {
                        label: "择校",
                    },
                    320: {
                        label: "政策分析",
                    },
                    321: {
                        label: "咨询",
                    },
                    322: {
                        label: "简历",
                    },
                    323: {
                        label: "面试",
                    },
                    324: {
                        label: "特长",
                    },
                    325: {
                        label: "三一口语",
                    },
                }
            },
            326: {
                label: "能力提升",
                cats: {
                    327: {
                        label: "小学能力提升",
                    },
                }
            },
            328: {
                label: "财商培训",
                cats: {
                    329: {
                        label: "财商培训",
                    },
                }
            },
            330: {
                label: "安全培训",
                cats: {
                    331: {
                        label: "安全培训",
                    },
                }
            },
            332: {
                label: "学习方法",
                cats: {
                    333: {
                        label: "学习方法",
                    },
                }
            },
            523: {
                label: "家教园",
                cats: {
                    524: {
                        label: "寄膳",
                    },
                    525: {
                        label: "课后辅导",
                    },
                }
            },
        }
    },
    334: {
        label: "初中",
        cats: {
            335: {
                label: "初一",
                cats: {
                    336: {
                        label: "数学",
                    },
                    337: {
                        label: "语文",
                    },
                    338: {
                        label: "英语",
                    },
                    339: {
                        label: "地理",
                    },
                    340: {
                        label: "政治",
                    },
                    341: {
                        label: "物理",
                    },
                    342: {
                        label: "化学",
                    },
                    343: {
                        label: "历史",
                    },
                    344: {
                        label: "生物",
                    },
                    345: {
                        label: "全科辅导",
                    },
                    346: {
                        label: "自然科学",
                    },
                    347: {
                        label: "英文版数学",
                    },
                    348: {
                        label: "英文版物理",
                    },
                    349: {
                        label: "英文版化学",
                    },
                    350: {
                        label: "奥数",
                    },
                    351: {
                        label: "科学",
                    },
                }
            },
            352: {
                label: "初二",
                cats: {
                    353: {
                        label: "数学",
                    },
                    354: {
                        label: "语文",
                    },
                    355: {
                        label: "英语",
                    },
                    356: {
                        label: "地理",
                    },
                    357: {
                        label: "政治",
                    },
                    358: {
                        label: "物理",
                    },
                    359: {
                        label: "化学",
                    },
                    360: {
                        label: "历史",
                    },
                    361: {
                        label: "生物",
                    },
                    362: {
                        label: "全科辅导",
                    },
                    363: {
                        label: "自然科学",
                    },
                    364: {
                        label: "英文版数学",
                    },
                    365: {
                        label: "英文版物理",
                    },
                    366: {
                        label: "英文版化学",
                    },
                    367: {
                        label: "奥数",
                    },
                    368: {
                        label: "科学",
                    },
                }
            },
            369: {
                label: "初三",
                cats: {
                    370: {
                        label: "数学",
                    },
                    371: {
                        label: "语文",
                    },
                    372: {
                        label: "英语",
                    },
                    373: {
                        label: "地理",
                    },
                    374: {
                        label: "政治",
                    },
                    375: {
                        label: "物理",
                    },
                    376: {
                        label: "化学",
                    },
                    377: {
                        label: "历史",
                    },
                    378: {
                        label: "生物",
                    },
                    379: {
                        label: "全科辅导",
                    },
                    380: {
                        label: "自然科学",
                    },
                    381: {
                        label: "英文版数学",
                    },
                    382: {
                        label: "英文版物理",
                    },
                    383: {
                        label: "英文版化学",
                    },
                    384: {
                        label: "奥数",
                    },
                    385: {
                        label: "科学",
                    },
                }
            },
            386: {
                label: "中考",
                cats: {
                    387: {
                        label: "数学",
                    },
                    388: {
                        label: "语文",
                    },
                    389: {
                        label: "英语",
                    },
                    390: {
                        label: "地理",
                    },
                    391: {
                        label: "政治",
                    },
                    392: {
                        label: "物理",
                    },
                    393: {
                        label: "化学",
                    },
                    394: {
                        label: "历史",
                    },
                    395: {
                        label: "生物",
                    },
                    396: {
                        label: "理综",
                    },
                    397: {
                        label: "文综",
                    },
                    398: {
                        label: "中考择校",
                    },
                    399: {
                        label: "中考全科辅导",
                    },
                    400: {
                        label: "中考心理辅导",
                    },
                    401: {
                        label: "科学",
                    },
                }
            },
            402: {
                label: "学习方法",
                cats: {
                    403: {
                        label: "学习方法",
                    },
                }
            },
        }
    },
    456: {
        label: "大学",
        cats: {
            457: {
                label: "英语考级",
                cats: {
                    458: {
                        label: "四级",
                    },
                    459: {
                        label: "六级",
                    },
                    460: {
                        label: "专四",
                    },
                    461: {
                        label: "专八",
                    },
                }
            },
            462: {
                label: "大学专业课",
                cats: {
                    463: {
                        label: "大学专业课",
                    },
                    543: {
                        label: "服装设计",
                    },
                }
            },
            464: {
                label: "考博",
                cats: {
                    465: {
                        label: "英语",
                    },
                    466: {
                        label: "专业课",
                    },
                    467: {
                        label: "面试辅导",
                    },
                }
            },
            468: {
                label: "成人",
                cats: {
                    469: {
                        label: "自学考试",
                    },
                    470: {
                        label: "成人高考",
                    },
                    471: {
                        label: "远程教育",
                    },
                    472: {
                        label: "函授",
                    },
                    473: {
                        label: "继续教育",
                    },
                }
            },
            474: {
                label: "专科",
                cats: {
                    476: {
                        label: "大专",
                    },
                    477: {
                        label: "专升本",
                    },
                }
            },
            478: {
                label: "考研",
                cats: {
                    479: {
                        label: "考研英语",
                    },
                    480: {
                        label: "MPAcc",
                    },
                    481: {
                        label: "MPA",
                    },
                    482: {
                        label: "SMBA",
                    },
                    483: {
                        label: "EMBA",
                    },
                    484: {
                        label: "MBA",
                    },
                    485: {
                        label: "在职研究生",
                    },
                    486: {
                        label: "考研专业课",
                    },
                    487: {
                        label: "考研政治",
                    },
                    488: {
                        label: "考研数学",
                    },
                    489: {
                        label: "MEM",
                    },
                }
            },
        }
    },
    490: {
        label: "语言",
        cats: {
            491: {
                label: "英语",
                cats: {
                    492: {
                        label: "公共英语",
                    },
                    493: {
                        label: "SLEP",
                    },
                    494: {
                        label: "口译",
                    },
                    495: {
                        label: "旅游英语",
                    },
                    496: {
                        label: "外贸英语",
                    },
                    497: {
                        label: "职称英语",
                    },
                    498: {
                        label: "TOEIC",
                    },
                    499: {
                        label: "BEC",
                    },
                    500: {
                        label: "MSE剑桥英语",
                    },
                    501: {
                        label: "口语",
                    },
                    502: {
                        label: "外教英语",
                    },
                    503: {
                        label: "新概念英语",
                    },
                    504: {
                        label: "词汇",
                    },
                    546: {
                        label: "国际英语",
                    },
                }
            },
            505: {
                label: "小语种",
                cats: {
                    506: {
                        label: "日语",
                    },
                    507: {
                        label: "法语",
                    },
                    508: {
                        label: "韩语",
                    },
                    509: {
                        label: "德语",
                    },
                    510: {
                        label: "西班牙语",
                    },
                    511: {
                        label: "俄语",
                    },
                    512: {
                        label: "意大利语",
                    },
                    513: {
                        label: "葡萄牙语",
                    },
                }
            },
            514: {
                label: "汉语培训",
                cats: {
                    515: {
                        label: "普通话等级考试",
                    },
                    516: {
                        label: "对外汉语",
                    },
                    517: {
                        label: "方言培训",
                    },
                }
            },
        }
    },
    520: {
        label: "其他",
        cats: {
            521: {
                label: "职业技能",
                cats: {
                    522: {
                        label: "网店运营",
                    },
                    536: {
                        label: "财务会计",
                    },
                }
            },
            535: {
                label: "户外拓展",
                cats: {
                    534: {
                        label: "体验式教育",
                    },
                }
            },
        }
    },
    531: {
        label: "高中",
        cats: {
            404: {
                label: "高一",
                cats: {
                    405: {
                        label: "数学",
                    },
                    406: {
                        label: "语文",
                    },
                    407: {
                        label: "英语",
                    },
                    408: {
                        label: "地理",
                    },
                    409: {
                        label: "政治",
                    },
                    410: {
                        label: "物理",
                    },
                    411: {
                        label: "化学",
                    },
                    412: {
                        label: "历史",
                    },
                    413: {
                        label: "生物",
                    },
                    414: {
                        label: "生命科学",
                    },
                    415: {
                        label: "信息技术",
                    },
                    416: {
                        label: "英文版数学",
                    },
                    417: {
                        label: "英文版物理",
                    },
                    418: {
                        label: "英文版化学",
                    },
                    419: {
                        label: "奥数",
                    },
                    420: {
                        label: "学业与职业规划",
                    },
                }
            },
            421: {
                label: "高二",
                cats: {
                    422: {
                        label: "数学",
                    },
                    423: {
                        label: "语文",
                    },
                    424: {
                        label: "英语",
                    },
                    425: {
                        label: "地理",
                    },
                    426: {
                        label: "政治",
                    },
                    427: {
                        label: "物理",
                    },
                    428: {
                        label: "化学",
                    },
                    429: {
                        label: "历史",
                    },
                    430: {
                        label: "生物",
                    },
                    431: {
                        label: "生命科学",
                    },
                    432: {
                        label: "信息技术",
                    },
                    433: {
                        label: "英文版数学",
                    },
                    434: {
                        label: "英文版物理",
                    },
                    435: {
                        label: "英文版化学",
                    },
                    436: {
                        label: "奥数",
                    },
                }
            },
            437: {
                label: "高考",
                cats: {
                    84: {
                        label: "美术高考",
                    },
                    438: {
                        label: "数学",
                    },
                    439: {
                        label: "语文",
                    },
                    440: {
                        label: "英语",
                    },
                    441: {
                        label: "地理",
                    },
                    442: {
                        label: "政治",
                    },
                    443: {
                        label: "物理",
                    },
                    444: {
                        label: "化学",
                    },
                    445: {
                        label: "历史",
                    },
                    446: {
                        label: "生物",
                    },
                    447: {
                        label: "理综",
                    },
                    448: {
                        label: "文综",
                    },
                    449: {
                        label: "高考志愿",
                    },
                    450: {
                        label: "艺考文化课",
                    },
                    451: {
                        label: "港澳面试",
                    },
                    452: {
                        label: "高考心理辅导",
                    },
                    453: {
                        label: "影视高考",
                    },
                    540: {
                        label: "音乐高考",
                    },
                }
            },
            454: {
                label: "学习方法",
                cats: {
                    455: {
                        label: "学习方法",
                    },
                }
            },
            541: {
                label: "专科",
                cats: {
                    475: {
                        label: "中专",
                    },
                }
            },
        }
    },
};

module.exports = cats;
